import pandas as pd

# 비슷한 자음 리스트 만들기
def get_similar_consonants():
    similar_consonants = {
        'ㄱ': ['ㅋ','ㄲ'],
        'ㄲ': ['ㄱ', 'ㅋ'],
        'ㄴ': ['ㅁ', 'ㅇ'],
        'ㄷ': ['ㅌ','ㄸ'],
        'ㄸ': ['ㄷ','ㅌ'],
        'ㄹ': [],
        'ㅁ': ['ㄴ','ㅇ'],
        'ㅂ': ['ㅃ','ㅍ','ㅁ'],
        'ㅃ': ['ㅂ','ㅍ','ㅁ'],
        'ㅅ': ['ㅆ', 'ㅈ', 'ㅉ','ㅊ','ㅎ'],
        'ㅆ': ['ㅅ', 'ㅈ','ㅉ','ㅊ','ㅎ'],
        'ㅇ': ['ㄴ','ㅁ'],
        'ㅈ': ['ㅉ','ㅊ','ㅅ', 'ㅆ', 'ㅎ'],
        'ㅉ': ['ㅈ','ㅊ','ㅅ','ㅆ','ㅎ'],
        'ㅊ': ['ㅈ','ㅉ','ㅅ','ㅆ','ㅎ'],
        'ㅋ': ['ㄱ','ㄲ'],
        'ㅌ': ['ㄷ','ㄸ'],
        'ㅍ': ['ㅂ','ㅃ','ㅁ'],
        'ㅎ': [],
        'ㅏ': ['ㅓ', 'ㅐ','ㅒ'],
        'ㅐ': ['ㅏ', 'ㅔ', 'ㅒ'],
        'ㅑ': ['ㅕ', 'ㅒ'],
        'ㅒ': ['ㅑ', 'ㅖ'],
        'ㅓ': ['ㅏ', 'ㅕ','ㅔ','ㅜ'],
        'ㅔ': ['ㅐ', 'ㅖ', 'ㅓ'],
        'ㅕ': ['ㅑ', 'ㅠ', 'ㅖ'],
        'ㅖ': ['ㅔ', 'ㅒ','ㅕ'],
        'ㅗ': ['ㅜ', 'ㅘ'],
        'ㅘ': ['ㅗ', 'ㅙ'],
        'ㅙ': ['ㅗ', 'ㅘ'],
        'ㅚ': ['ㅞ', 'ㅙ'],
        'ㅛ': ['ㅠ'],
        'ㅠ': ['ㅛ', 'ㅕ'],
        'ㅜ': ['ㅗ', 'ㅝ'],
        'ㅝ': ['ㅜ', 'ㅞ'],
        'ㅞ': ['ㅝ', 'ㅚ'],
        'ㅟ': ['ㅠ', 'ㅚ'],
        'ㅠ': ['ㅛ', 'ㅟ'],
        'ㅡ': [],  # 독특한 발음으로 별도의 그룹 없음
        'ㅢ': ['ㅡ', 'ㅣ'],
        'ㅣ': ['ㅢ'],
    }
    
    return similar_consonants

def get_similar_vowels():
    similar_vowels = {
        'ㅏ': ['ㅓ', 'ㅐ','ㅒ'],
        'ㅐ': ['ㅏ', 'ㅔ', 'ㅒ'],
        'ㅑ': ['ㅕ', 'ㅒ'],
        'ㅒ': ['ㅑ', 'ㅖ'],
        'ㅓ': ['ㅏ', 'ㅕ','ㅔ','ㅜ'],
        'ㅔ': ['ㅐ', 'ㅖ', 'ㅓ'],
        'ㅕ': ['ㅑ', 'ㅠ', 'ㅖ'],
        'ㅖ': ['ㅔ', 'ㅒ','ㅕ'],
        'ㅗ': ['ㅜ', 'ㅘ'],
        'ㅘ': ['ㅗ', 'ㅙ'],
        'ㅙ': ['ㅗ', 'ㅘ'],
        'ㅚ': ['ㅞ', 'ㅙ'],
        'ㅛ': ['ㅠ'],
        'ㅠ': ['ㅛ', 'ㅕ'],
        'ㅜ': ['ㅗ', 'ㅝ'],
        'ㅝ': ['ㅜ', 'ㅞ'],
        'ㅞ': ['ㅝ', 'ㅚ'],
        'ㅟ': ['ㅠ', 'ㅚ'],
        'ㅠ': ['ㅛ', 'ㅟ'],
        'ㅡ': [],  # 독특한 발음으로 별도의 그룹 없음
        'ㅢ': ['ㅡ', 'ㅣ'],
        'ㅣ': ['ㅢ'],
    }

    return similar_vowels